{
  "source": "newsdata_io",
  "timestamp": "2025-06-18T14:18:46.519463",
  "location": "New York",
  "content": "Spain blames April blackout on grid failures and poor planning, not a cyberattack: The Supreme Court on Wednesday upheld Tennessee’s ban on gender-affirming care for transgender minors, a stunning setback to transgender rights.The justices’ 6-3 decision effectively protects from legal challenges many efforts by President Donald Trump’s Republican administration and state governments to roll back protections for transgender people. Another 26 states have laws similar to the one in Tennessee.Chief Justice John Roberts wrote for a conservative majority that the law does not violate the Constitution’s equal protection clause, which requires the government to treat similarly situated people the same.Roberts wrote this “case carries with it the weight of fierce scientific and policy debates about the safety, efficacy, and propriety of medical treatments in an evolving field. The voices in these debates raise sincere concerns; the implications for all are profound.”But the court’s role, Roberts continued, is “only to ensure that” the law “does not violate” the equal protection clause. “Having concluded that it does not, we leave questions regarding its policy to the people, their elected representatives, and the democratic process.”Justice Sonya Sotomayor, joined by her liberal colleagues Justice Elena Kagan and Justice Ketanji Brown Jackson, dissented. Sotomayor wrote that the majority “abandons transgender children and their families to political whims.”The decision comes amid a range of other federal and state efforts to regulate the lives of transgender people, including which sports competitions they can join and which bathrooms they can use. In April, President Donald Trump’s administration sued Maine for not complying with the government’s push to ban transgender athletes in girls sports.The Republican president also has sought to block federal spending on gender-affirming medical care for those under age 19 — instead promoting talk therapy only to treat young transgender people. In addition, the Supreme Court has allowed him to kick transgender service members out of the military, even as court battles continue. The president also signed another order to define the sexes as only male and female.Trump’s administration has also called for using only therapy, not broader health measures, to treat transgender youths.The justices acted a month after the United Kingdom’s top court delivered a setback to transgender rights, ruling unanimously that the U.K. Equality Act means trans women can be excluded from some groups and single-sex spaces, such as changing rooms, homeless shelters, swimming areas and medical or counseling services provided only to women.Five years ago, the Supreme Court ruled that transgender people, as well as gay and lesbian people, are protected by a landmark federal civil rights law that prohibits sex discrimination in the workplace. That decision is not affected by Wednesday’s ruling.But the justices on Wednesday declined to apply the same sort of analysis the court used in 2020 when it found that “sex plays an unmistakable role” in employers’ decisions to punish transgender people for traits and behavior they otherwise tolerate.There are about 300,000 people between the ages of 13 and 17 and 1.3 million adults who identify as transgender in the United States, according to the Williams Institute at the UCLA School of Law. The Williams Institute is a think tank that researches sexual orientation and gender identity demographics to inform laws and public policy decisions.When the case was argued in December, then-President Joe Biden’s Democratic administration and families of transgender adolescents had called on the high court to strike down the Tennessee ban as unlawful sex discrimination and protect the constitutional rights of vulnerable Americans.They argued that the law violates the equal protection clause of the 14th Amendment, which requires the government to treat similarly situated people the same.Tennessee’s law bans puberty blockers and hormone treatments for transgender minors, but it allows the same drugs to be used for other purposes.Soon after Trump took office, the Justice Department told the court that its position had changed.A major issue in the case was the appropriate level of scrutiny courts should apply to such laws.The lowest level is known as rational basis review, and almost every law looked at that way is ultimately upheld. Indeed, the federal appeals court in Cincinnati that allowed the Tennessee law to be enforced held that lawmakers acted rationally to regulate medical procedures, well within their authority.The appeals court reversed a trial court that employed a higher level of review, heightened scrutiny, which applies in cases of sex discrimination. Under this more searching examination, the state must identify an important objective and show that the law helps accomplish it.This is a breaking news story. Please check back for updates.",
  "type": "news",
  "url": "https://www.nbcnewyork.com/news/national-international/spain-blames-april-blackout-on-grid-failures-and-poor-planning-not-a-cyberattack/6307016/",
  "category": [
    "top"
  ]
}