{
  "source": "newsdata_io",
  "timestamp": "2025-06-18T14:00:52.105246",
  "location": "New York",
  "content": "Eve Air Mobility and Future Flight Global Sign Letter of Intent for up to 54 eVTOLs Serving Brazil and the United States: PARIS, June 18, 2025 /PRNewswire/ -- Eve Air Mobility (\"Eve\") (NYSE:EVEX, EVEXW)) has signed a Letter of Intent (LOI) with Future Flight Global, a pioneer in electric aircraft for up to 54 electric Vertical Take-Off and Landing (eVTOL) aircraft, targeting the Brazil and United States markets. This LOI strengthens Eve's backlog of LOIs ranging from global carriers to regional airlines to urban transportation-focused entities such as Future Flight Global.\"This collaboration with Future Flight Global is a significant step forward for Urban Air Mobility in the Americas. By leveraging Eve's proven eVTOL technology and robust certification process, Future Flight Global gains a powerful platform to deliver efficient, sustainable air travel in high-demand markets such as Brazil and the United States,\" said Megha Bhatia, chief commercial officer at Eve Air Mobility. \"We're excited to be their strategic partner in this endeavor, laying the groundwork for substantial future orders as they expand their fleet.\"Headquartered in Washington, DC, Future Flight Global will draw on its deep operational expertise to expand Eve's existing and substantial market share, while leveraging its strength in Brazil to serve that market. Together, the companies aim to transform urban mobility on a global scale by deploying eVTOL aircraft that dramatically reduce travel times and ease congestion in major cities.\"We are building a diversified electric aircraft fleet for global deployment across multiple mission profiles,\" said Karan Singh, chief executive officer of Future Flight Global. \"Eve's aircraft—rooted in Embraer's 55-year legacy of designing, certifying, and supporting commercial and business aircraft—checks every ...Full story available on Benzinga.com",
  "type": "news",
  "url": "https://www.benzinga.com/pressreleases/25/06/n45989192/eve-air-mobility-and-future-flight-global-sign-letter-of-intent-for-up-to-54-evtols-serving-brazil",
  "category": [
    "top",
    "business"
  ]
}